---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalSetting.VoltageTypes
source: html/537601fb-42b8-f7b0-bd1a-58b4e4adf437.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalSetting.VoltageTypes Property

Get all voltage type definitions information of the project.

## Syntax (C#)
```csharp
public VoltageTypeSet VoltageTypes { get; }
```